public class Task4 {
//    Дана скобочная последовательность: [((())()(())]]
//            - Можно ли считать эту последовательность правильной?
//            - Если ответ на предыдущий вопрос “нет” - то что необходимо в ней изменить, чтоб она стала правильной?

//    Ответ: Данная последовательность не является правильной поскольку :
//    1. отсутствует первая открывающая квадратная скобка.
//    2. отсутствует последняя закрывающаяя круглая скобка.
//
//    [ ( ( ( ) ) ( ) ( ( ) ) ] ] - неправильно.
//    [ [ ( ( ( ) ) ( ) ( ( ) ) ) ] ]   - правильно.
//

}
